import Batalha from "../batalha/Batalha";
export function telaInicial() {
    console.log(`
    ╔════════════════════════════════════════════╗
    ║                                            ║
    ║        ⚔️  ARENA DOS REINOS  ⚔️              ║
    ║                                            ║
    ║        Um RPG de Batalha Medieval          ║
    ║                                            ║
    ║   Guerreiros, Magos e Arqueiros disputam   ║
    ║        honra, glória e sobrevivência       ║
    ║                                            ║
    ║                                            ║
    ║      ▶ Pressione ENTER para começar ◀      ║
    ║                                            ║
    ╚════════════════════════════════════════════╝
    `);
} 

export function telaMenuPrincipal() {
    console.log(`
    ╔════════════════════════════════════════════╗
    ║            🏰 MENU PRINCIPAL 🏰            ║
    ╠════════════════════════════════════════════╣
    ║                                            ║
    ║  [ 1 ] Criar personagem                    ║
    ║  [ 2 ] Listar personagens                  ║
    ║  [ 3 ] Iniciar batalha                     ║
    ║  [ 0 ] Encerrar jogo                       ║
    ║                                            ║
    ║  Escolha uma opção:                        ║
    ║                                            ║
    ╚════════════════════════════════════════════╝
    `);
}

export function telaCriarPersonagemClasse() {
    console.log (`
    ╔════════════════════════════════════════════╗
    ║          🧾 CRIAÇÃO DE PERSONAGEM 🧾       ║
    ╠════════════════════════════════════════════╣
    ║                                            ║
    ║  Escolha a classe do personagem:           ║
    ║                                            ║
    ║  [ 1 ] 🛡️  Guerreiro                        ║
    ║  [ 2 ] 🔮 Mago                             ║
    ║  [ 3 ] 🏹 Arqueiro                         ║
    ║                                            ║
    ║  Digite o número da classe desejada:       ║
    ║                                            ║
    ╚════════════════════════════════════════════╝

`);
}

export function telaCriarPersonagemNome() {
    console.log (`
    ╔════════════════════════════════════════════╗
    ║          ✏️  NOME DO PERSONAGEM ✏️           ║
    ╠════════════════════════════════════════════╣
    ║                                            ║
    ║  Digite o nome do seu personagem:          ║
    ║                                            ║
    ╚════════════════════════════════════════════╝
    `);
}

export function telaConfirmarCriacao(nome: string, classe: string) {
    console.log(`
    ╔════════════════════════════════════════════╗
    ║            ✅ CONFIRMAÇÃO                  ║
    ╠════════════════════════════════════════════╣
    ║                                            ║
    ║  Classe escolhida: ${classe}                ║
    ║  Nome do personagem:  ${nome}              ║
    ║                                            ║
    ║  Deseja confirmar a criação?               ║
    ║                                            ║
    ║  [ 1 ] Sim                                 ║
    ║  [ 0 ] Cancelar                            ║
    ║                                            ║
    ╚════════════════════════════════════════════╝
    `); 
}

export function telaPersonagemCriado(nome: string) {
  console.log(`
    ╔════════════════════════════════════════════╗
    ║            🎉 PERSONAGEM CRIADO 🎉         ║
    ║                                            ║
    ║  ${nome} foi adicionado à Arena dos Reinos ║
    ║                                            ║
    ╚════════════════════════════════════════════╝
    `);
}




export function telaListarPersonagensVazio() {
    console.log(`
    ╔════════════════════════════════════════════╗
    ║           📜 PERSONAGENS DA ARENA          ║
    ╠════════════════════════════════════════════╣
    ║                                            ║
    ║  Nenhum personagem foi criado até agora.   ║
    ║                                            ║
    ║  Crie heróis para iniciar a batalha.       ║
    ║                                            ║
    ║  [ 0 ] Voltar ao menu principal            ║
    ║                                            ║
    ╚════════════════════════════════════════════╝
    `);
}

export function telaIniciarBatalhaConfirmacao(batalha: Batalha) {
    const personagens = batalha.listarPersonagens();
    const vivos = personagens.filter(p => p.estaVivo());

    // Se não tiver personagens vivos, dá um erro
    if (vivos.length < 2) {
        console.log(`
        ╔════════════════════════════════════════════╗
        ║  Não há personagens suficientes para a batalha. ║
        ║  Crie pelo menos dois personagens.         ║
        ╚════════════════════════════════════════════╝
        `);
        return;
    }

    // Exibe os personagens vivos para escolha
    console.log(`
    ╔════════════════════════════════════════════╗
    ║           ⚔️ INICIAR BATALHA ⚔️              ║
    ╠════════════════════════════════════════════╣
    ║                                            ║
    ║  Personagens disponíveis para a batalha:   ║
    ║                                            ║
    `);

    vivos.forEach((p, index) => {
        console.log(`║  ${index + 1}) ${p.nome} | ❤️ ${p.vida}  ║`);
    });

    console.log(`
    ║                                            ║
    ║  Deseja iniciar a batalha agora?           ║
    ║                                            ║
    ║  [ 1 ] Sim                                 ║
    ║  [ 0 ] Cancelar                            ║
    ║                                            ║
    ╚════════════════════════════════════════════╝
    `);
}

// export function telaIniciarBatalhaConfirmacao() {
//     console.log(`
//     ╔════════════════════════════════════════════╗
//     ║           ⚔️ INICIAR BATALHA ⚔️              ║
//     ╠════════════════════════════════════════════╣
//     ║                                            ║
//     ║  A Arena dos Reinos está prestes a abrir.  ║
//     ║                                            ║
//     ║  Personagens disponíveis para a batalha:   ║
//     ║                                            ║
//     ║  1) Thorgal   🛡️ Guerreiro   | ❤️ 100        ║
//     ║  2) Lyra      🔮 Mago        | ❤️ 100       ║
//     ║  3) Elandor   🏹 Arqueiro    | ❤️ 100       ║
//     ║                                            ║
//     ║  Deseja iniciar a batalha agora?           ║
//     ║                                            ║
//     ║  [ 1 ] Sim                                 ║
//     ║  [ 0 ] Cancelar                            ║
//     ║                                            ║
//     ╚════════════════════════════════════════════╝
//     `);
// }

export function telaIniciarBatalhaErro() {
    console.log(`
    ╔════════════════════════════════════════════╗
    ║           ⚔️ INICIAR BATALHA ⚔️              ║
    ╠════════════════════════════════════════════╣
    ║                                            ║
    ║  Não há personagens suficientes            ║
    ║  para iniciar uma batalha.                 ║
    ║                                            ║
    ║  Crie pelo menos dois personagens.         ║
    ║                                            ║
    ║  [ 0 ] Voltar ao menu principal            ║
    ║                                            ║
    ╚════════════════════════════════════════════╝
    `);
}


export function telaBatalhaIniciada() {
    console.log(`
    ╔════════════════════════════════════════════╗
    ║          ⚔️ BATALHA INICIADA ⚔️              ║
    ╠════════════════════════════════════════════╣
    ║                                            ║
    ║  A Arena foi aberta!                       ║
    ║                                            ║
    ║  Os combatentes estão prontos.             ║
    ║                                            ║
    ║  Que a batalha comece!                     ║
    ║                                            ║
    ╚════════════════════════════════════════════╝
    `);
}

export function telaEscolherAtacante() {
    console.log(`
    ╔════════════════════════════════════════════╗
    ║           ⚔️ EXECUTAR TURNO ⚔️               ║
    ╠════════════════════════════════════════════╣
    ║                                            ║
    ║  Escolha o ATACANTE:                       ║
    ║                                            ║
    ║  [ 1 ] Thorgal   🛡️ Guerreiro | ❤️ 40        ║
    ║  [ 2 ] Lyra      🔮 Mago      | ❤️ 65       ║
    ║  [ 3 ] Elandor   🏹 Arqueiro  | ❤️ 18       ║
    ║                                            ║
    ║  Digite o número do atacante:              ║
    ║                                            ║
    ╚════════════════════════════════════════════╝
    `);
}

export function telaEscolherAtacado() {
    console.log(`
    ╔════════════════════════════════════════════╗
    ║           🩸 ESCOLHER ATACADO              ║
    ╠════════════════════════════════════════════╣
    ║                                            ║
    ║  Escolha quem será atacado:                ║
    ║                                            ║
    ║  [ 1 ] Thorgal   🛡️ Guerreiro | ❤️ 40        ║
    ║  [ 2 ] Lyra      🔮 Mago      | ❤️ 65       ║
    ║  [ 3 ] Elandor   🏹 Arqueiro  | ❤️ 18       ║
    ║                                            ║
    ║  Digite o número do atacado:               ║
    ║                                            ║
    ╚════════════════════════════════════════════╝
    `);
}



import Acao from "../batalha/Acao";

export function telaCronicas(acoes: Acao[]) {
  console.log(`
    ╔════════════════════════════════════════════╗
    ║          📖 CRÔNICAS DA BATALHA            ║
    ╠════════════════════════════════════════════╣
    `);

    if (acoes.length === 0) {
        console.log("║  Nenhuma ação registrada até agora.       ║");
    }

    acoes.forEach((acao, index) => {
        console.log(
        `║ [${String(index + 1).padStart(2, "0")}] ${acao.origem.nome} atacou ${acao.alvo.nome} (${acao.valorDano} dano)`
        );
    });

    console.log(`
    ║                                            ║
    ║  Pressione ENTER para voltar               ║
    ╚════════════════════════════════════════════╝
    `);
}


export function telaFimBatalhaVencedor() {
    console.log(`
    ╔════════════════════════════════════════════╗
    ║            🏆 FIM DA BATALHA               ║
    ╠════════════════════════════════════════════╣
    ║                                            ║
    ║  Thorgal foi o último de pé!               ║
    ║                                            ║
    ║  Vitória gloriosa na Arena dos Reinos!     ║
    ║                                            ║
    ║  Pressione ENTER para voltar ao menu       ║
    ║                                            ║
    ╚════════════════════════════════════════════╝
    `);
}

export function telaFimBatalhaSemVencedor() {
    console.log(`
    ╔════════════════════════════════════════════╗
    ║            ☠️ FIM DA BATALHA                ║
    ╠════════════════════════════════════════════╣
    ║                                            ║
    ║  Nenhum personagem sobreviveu.             ║
    ║                                            ║
    ║  A Arena silencia...                       ║
    ║                                            ║
    ║  Pressione ENTER para voltar ao menu       ║
    ║                                            ║
    ╚════════════════════════════════════════════╝
    `);
}

export function telaFimJornada() {
console.log(`
╔════════════════════════════════════════════╗
║              🏰 FIM DA JORNADA             ║
╠════════════════════════════════════════════╣
║                                            ║
║  Obrigado por jogar Arena dos Reinos.      ║
║                                            ║
║  Que a glória acompanhe seus heróis! ⚔️     ║
║                                            ║
╚════════════════════════════════════════════╝
`);
}